newbc/env-incrementalbc-test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            inletParabolicVelocity;
        maxValue        0;
        n               (1 0 0);
        y               (0 1 0);
        value           (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    CYLINDER
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            incrementalJetParabolicVelocity;
        omega           0.17453293;
        r               0.05;
        theta0          1.5707963;
        q0              1;
        q1              2;
        alpha           0.6;
        deltaT          0.0005;
        t0              0;
        value           uniform (0 0 0);  
    }
    
    JET2
    {
        type            incrementalJetParabolicVelocity;
        omega           0.17453293;
        r               0.05;
        theta0          1.5707963;
        q0              1;
        q1              2;
        alpha           0.6;
        t0              0;
        deltaT          0.0005;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
