newbc/env-incrementalbc-test/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    OUTLET
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    TOP
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    BOTTOM
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    CYLINDER
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    JET1
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(0 -0 0)
(2.4651903e-32 3.8518599e-34 -2.8421709e-14)
(-1.2325952e-32 9.6296497e-35 0)
(0 -0 -5.6843419e-14)
(0 -0 2.8421709e-14)
(0 -0 0)
(0 -0 2.8421709e-14)
(1.2325952e-32 3.8518599e-34 5.6843419e-14)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(-2.4651903e-32 -0 5.6843419e-14)
(0 -0 -2.8421709e-14)
(0 -0 0)
(0 -0 0)
(0 -9.6296497e-35 -1.4210855e-14)
(0 -0 0)
)
;
    }
    JET2
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(-1.2325952e-32 9.6296497e-35 -1.4210855e-14)
(0 -0 -2.8421709e-14)
(0 -0 5.6843419e-14)
(0 -0 0)
(6.1629758e-33 -0 0)
(0 -0 2.8421709e-14)
(-1.2325952e-32 -0 2.8421709e-14)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -9.6296497e-35 0)
(0 -0 1.4210855e-14)
(0 -0 5.6843419e-14)
(2.4651903e-32 -0 1.1368684e-13)
(0 -0 0)
(1.2325952e-32 3.8518599e-34 0)
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
